const fs = require("fs")
const os = require("os")

let handler = async (m, { clutch, runtime }) => {
  let teksnya = `
╭═══⬡𝑁𝐸𝑀𝐸𝑆𝐼𝑆 𝑀𝐷 𝐼𝐍𝐹𝑂 ⬡═══⬡ 
║友│⊷ Bᴏᴛ ɴᴀᴍᴇ  : ${global.botname2}
║友│⊷ Vᴇʀsɪᴏɴ : ${global.versi}
║友│⊷ Mᴏᴅᴇ : ${clutch.public ? "Public" : "Self"}
║友│⊷ Oᴡɴᴇʀs : +${global.owner}
║友│⊷ Rᴜɴᴛɪᴍᴇ : ${runtime(process.uptime())}
╰═══════════════════⬡

> © Kᴇᴠɪɴ ᴛᴇᴄʜ x Rɪᴅᴢ Cᴏᴅᴇʀ

╭═══⬡Oᴡɴᴇʀs ᴄᴏᴍᴍᴀɴᴅs⬡═══⬡ 
║友│⊷ sᴇʟғ
║友│⊷ ᴘᴜʙʟɪᴄ
║友│⊷ ɢᴇᴛsᴄ
║友│⊷ ʀᴇsᴇᴛᴅʙ
║友│⊷ sᴇᴛᴘᴘʙᴏᴛ
║友│⊷ ᴄʟᴇᴀʀᴄʜᴀᴛ
║友│⊷ ᴀᴅᴅᴏᴡɴᴇʀ
║友│⊷ ᴅᴇʟᴏᴡɴᴇʀ
║友│⊷ ʟɪsᴛᴏᴡɴᴇʀ
║友│⊷ ᴀᴅᴅᴘʀᴇᴍ
║友│⊷ ᴅᴇʟᴘʀᴇᴍ
║友│⊷ ʟɪsᴛᴘʀᴇᴍ
║友│⊷ ᴊᴘᴍ
║友│⊷ ᴀᴅᴅᴄᴀsᴇ
║友│⊷ ᴅᴇʟᴄᴀsᴇ
║友│⊷ ᴀᴅᴅsᴛᴏʀᴇ
║友│⊷ ᴅᴇʟsᴛᴏʀᴇ
║友│⊷ ʙʟᴏᴄᴋ 
║友│⊷ ᴏᴡɴᴇʀ
║友│⊷ ᴅᴇʟᴘʀᴇᴍ
║友│⊷ ʟɪsᴛᴘʀᴇᴍ
║友│⊷ ᴀᴅᴅᴘʀᴇᴍ
╰═══════════════════⬡

╭═══⬡Fᴜɴ ᴄᴏᴍᴍᴀɴᴅs⬡═══⬡ 
║友│⊷ᴊᴏᴋᴇ
║友│⊷ǫᴜᴏᴛᴇ
║友│⊷ғᴀᴄᴛ
║友│⊷ʀᴏᴀsᴛ
║友│⊷ᴄᴏᴍᴘʟɪᴍᴇɴᴛ
║友│⊷ᴛʀᴜᴛʜ
║友│⊷ᴅᴀʀᴇ
║友│⊷ʀɪᴅᴅʟᴇ
║友│⊷ɢᴜᴇss
║友│⊷ᴄᴏɪɴ
║友│⊷ᴅɪᴄᴇ
║友│⊷8ʙᴀʟʟ
║友│⊷ᴍᴇᴍᴇ
║友│⊷ᴀɴɪᴍᴇ
╰═══════════════════⬡

╭═══⬡Rᴇʟɪɢɪᴏɴ ᴍᴇɴᴜ ⬡═══⬡ 
║友│⊷ʙɪʙʟᴇ 
║友│⊷ʙɪʙʟᴇʟɪsᴛ 
║友│⊷Qᴜʀᴀɴ 
║友│⊷ǫᴜʀᴀɴʟɪsᴛ
╰═══════════════════⬡

╭═══⬡ʀᴇᴀᴄᴛɪᴏɴ ᴍᴇɴᴜ⬡═══⬡ 
║友│⊷ʜᴜɢ
║友│⊷ᴋɪss
║友│⊷ᴄᴜᴅᴅʟᴇ
║友│⊷sʟᴀᴘ
║友│⊷ᴘᴀᴛ
║友│⊷ᴘᴏᴋᴇ
║友│⊷ʙɪᴛᴇ
║友│⊷ᴋɪʟʟ
║友│⊷ʙʟᴜsʜ
║友│⊷ᴄʀʏ
║友│⊷sᴍɪʟᴇ
╰═══════════════════⬡

╭═══⬡ᴛᴏᴏʟs ᴄᴏᴍᴍᴀɴᴅs ⬡═══⬡ 
║友│⊷ sʜᴏʀᴛʟɪɴᴋ
║友│⊷ ᴛᴏᴜʀʟ
║友│⊷ ssᴡᴇʙ
║友│⊷ sᴛɪᴄᴋᴇʀ
║友│⊷ ʙʀᴀᴛ
║友│⊷ ᴠᴠ
║友│⊷ ɴᴇᴡs
║友│⊷ ʟɪɴᴇs
║友│⊷ ᴛᴛsᴛᴀʟᴋ
║友│⊷ ᴍsɢ
║友│⊷ ᴊᴏᴋᴇ
║友│⊷ ʙɪʙʟᴇ 
║友│⊷ ᴀɪ
║友│⊷ ᴛᴛs
║友│⊷ ᴍᴏᴠɪᴇɪɴғᴏ
║友│⊷ ɢᴇᴛᴘᴘ
╰═══════════════════⬡

╭═══⬡ᴅᴏᴡɴʟᴏᴀᴅ ᴄᴏᴍᴍᴀɴᴅs⬡═══⬡ 
║友│⊷ ᴘʟᴀʏ
║友│⊷ ᴘʟᴀʏ2
║友│⊷ ᴘʟᴀʏᴠɪᴅ
║友│⊷ ʏᴛᴍᴘ4
║友│⊷ ᴛɪᴋᴛᴏᴋ
╰═══════════════════⬡

╭═══⬡Gʀᴏᴜᴘ ᴄᴏᴍᴍᴀɴᴅs ⬡═══⬡ 
║友│⊷ sᴡɢᴄ
║友│⊷ ᴋɪᴄᴋ
║友│⊷ ᴘʀᴏᴍᴏᴛᴇ
║友│⊷ ᴅᴇᴍᴏᴛᴇ
║友│⊷ ᴛᴀɢᴀʟʟ
║友│⊷ ʜɪᴅᴇᴛᴀɢ
║友│⊷ ʟɪɴᴋɢᴄ
║友│⊷ ʀᴇsᴇᴛʟɪɴᴋɢᴄ
║友│⊷ ᴏᴘᴇɴɢᴄ
║友│⊷ ᴄʟᴏsᴇɢᴄ
║友│⊷ sᴡɢᴄ_ᴘʀᴏᴄᴇss
║友│⊷ ᴊᴏɪɴɢᴄ
║友│⊷ ʟᴇᴀᴠᴇ
╰═══════════════════⬡
`

  await clutch.sendMessage(
    m.chat,
    {
      image: { url: global.image.menu },
      caption: teksnya,
      contextInfo: {
        mentionedJid: [m.sender],
        forwardingScore: 999,
        isForwarded: true,
        forwardedNewsletterMessageInfo: {
          newsletterJid: "120363404529319592@newsletter",
          newsletterName: "Nemesis MD Updates 🔥",
          serverMessageId: 3
        }
      }
    }
  )
}

handler.command = ["menu","ridz","kevin"]

module.exports = handler