const fs = require("fs")
const os = require("os")

let handler = async (m, { clutch, runtime }) => {
  let teksnya = `
╭──⧼♛ 𝙽𝙴𝙼𝙴𝚂𝙸𝚂 𝙼𝙳 𝚅𝟸 𝙸𝙽𝙵𝙾 ♛⧽──≽
│┃ ♛ Bᴏᴛ ɴᴀᴍᴇ  : ${global.botname2}
│┃ ♛ Vᴇʀsɪᴏɴ : ${global.versi}
│┃ ♛ Mᴏᴅᴇ : ${clutch.public ? "Public" : "Self"}
│┃ ♛ Oᴡɴᴇʀs : +${global.owner}
│┃ ♛ Rᴜɴᴛɪᴍᴇ : ${runtime(process.uptime())}
╰───────────────────≽

> © Kᴇᴠɪɴ ᴛᴇᴄʜ x Rɪᴅᴢ Cᴏᴅᴇʀ

╭──⧼♛ Oᴡɴᴇʀs ᴄᴏᴍᴍᴀɴᴅs♛⧽──≽
│┃ ♛ sᴇʟғ
│┃ ♛ ᴘᴜʙʟɪᴄ
│┃ ♛ ɢᴇᴛsᴄ
│┃ ♛ ʀᴇsᴇᴛᴅʙ
│┃ ♛ sᴇᴛᴘᴘʙᴏᴛ
│┃ ♛ ᴄʟᴇᴀʀᴄʜᴀᴛ
│┃ ♛ ᴀᴅᴅᴏᴡɴᴇʀ
│┃ ♛ ᴅᴇʟᴏᴡɴᴇʀ
│┃ ♛ ʟɪsᴛᴏᴡɴᴇʀ
│┃ ♛ ᴀᴅᴅᴘʀᴇᴍ
│┃ ♛ ᴅᴇʟᴘʀᴇᴍ
│┃ ♛ ʟɪsᴛᴘʀᴇᴍ
│┃ ♛ ᴊᴘᴍ
│┃ ♛ ᴀᴅᴅᴄᴀsᴇ
│┃ ♛ ᴅᴇʟᴄᴀsᴇ
│┃ ♛ ᴀᴅᴅsᴛᴏʀᴇ
│┃ ♛ ᴅᴇʟsᴛᴏʀᴇ
│┃ ♛ ʙʟᴏᴄᴋ 
│┃ ♛ ʀᴇᴘᴏ
│┃ ♛ ᴏᴡɴᴇʀ
│┃ ♛ ᴅᴇʟᴘʀᴇᴍ
│┃ ♛ ʟɪsᴛᴘʀᴇᴍ
│┃ ♛ ᴀᴅᴅᴘʀᴇᴍ
╰───────────────────≽

╭──⧼♛ Fᴜɴ ᴄᴏᴍᴍᴀɴᴅs♛⧽──≽
│┃ ♛ ᴊᴏᴋᴇ
│┃ ♛ ǫᴜᴏᴛᴇ
│┃ ♛ ғᴀᴄᴛ
│┃ ♛ ʀᴏᴀsᴛ
│┃ ♛ ᴄᴏᴍᴘʟɪᴍᴇɴᴛ
│┃ ♛ ᴛʀᴜᴛʜ
│┃ ♛ ᴅᴀʀᴇ
│┃ ♛ ʀɪᴅᴅʟᴇ
│┃ ♛ ɢᴜᴇss
│┃ ♛ ᴄᴏɪɴ
│┃ ♛ ᴅɪᴄᴇ
│┃ ♛ 8ʙᴀʟʟ
│┃ ♛ ᴍᴇᴍᴇ
│┃ ♛ ᴀɴɪᴍᴇ
╰───────────────────≽

╭──⧼♛ Rᴇʟɪɢɪᴏɴ ᴍᴇɴᴜ ♛⧽──≽
│┃ ♛ ʙɪʙʟᴇ 
│┃ ♛ ʙɪʙʟᴇʟɪsᴛ 
│┃ ♛ Qᴜʀᴀɴ 
│┃ ♛ ǫᴜʀᴀɴʟɪsᴛ
╰───────────────────≽

╭──⧼♛ ʀᴇᴀᴄᴛɪᴏɴ ᴍᴇɴᴜ♛⧽──≽
│┃ ♛ ʜᴜɢ
│┃ ♛ ᴋɪss
│┃ ♛ ᴄᴜᴅᴅʟᴇ
│┃ ♛ sʟᴀᴘ
│┃ ♛ ᴘᴀᴛ
│┃ ♛ ᴘᴏᴋᴇ
│┃ ♛ ʙɪᴛᴇ
│┃ ♛ ᴋɪʟʟ
│┃ ♛ ʙʟᴜsʜ
│┃ ♛ ᴄʀʏ
│┃ ♛ sᴍɪʟᴇ
╰───────────────────≽

╭──⧼♛ Aɪ ᴄᴏᴍᴍᴀɴᴅ ⬡═══⬡
│┃ ♛ ᴀsᴋ
│┃ ♛ ᴄʜᴀᴛʙᴏᴛ
│┃ ♛ Cʟᴀᴜᴅᴇ 
│┃ ♛ ɴᴇᴍᴇsɪsᴀɪ
│┃ ♛ ᴍɪsᴛʀᴀʟ
│┃ ♛ ᴘᴇʀᴘʟᴇxɪᴛʏ
│┃ ♛ ɢᴘᴛ4ɴᴀɴᴏ
│┃ ♛ ʙᴀʀᴅ
│┃ ♛ ᴠᴇɴɪᴄᴇ
╰───────────────────≽

╭──⧼♛ ᴛᴏᴏʟs ᴄᴏᴍᴍᴀɴᴅs ♛⧽──≽
│┃ ♛ sʜᴏʀᴛʟɪɴᴋ
│┃ ♛ ᴛᴏᴜʀʟ
│┃ ♛ ssᴡᴇʙ
│┃ ♛ sᴛɪᴄᴋᴇʀ
│┃ ♛ ʙʀᴀᴛ
│┃ ♛ ᴠᴠ
│┃ ♛ ɴᴇᴡs
│┃ ♛ ʟɪɴᴇs
│┃ ♛ ᴛᴛsᴛᴀʟᴋ
│┃ ♛ ᴍsɢ
│┃ ♛ ᴛᴛs
│┃ ♛ ᴍᴏᴠɪᴇɪɴғᴏ
│┃ ♛ ɢᴇᴛᴘᴘ
│┃ ♛ ʟʏʀɪᴄs
│┃ ♛ ʏᴛs
│┃ ♛ ᴍᴏᴠɪᴇ
│┃ ♛ sʜᴀᴢᴀᴍ
│┃ ♛ ɢsᴍᴀʀᴇɴᴀ
│┃ ♛ ɢᴇᴛᴅᴇᴠɪᴄᴇ
│┃ ♛ ʙʀᴏᴡsᴇ
│┃ ♛ ғɪʟᴛᴇʀᴠᴄғ
╰───────────────────≽

╭──⧼♛ ᴅᴏᴡɴʟᴏᴀᴅ ᴄᴏᴍᴍᴀɴᴅs♛⧽──≽
│┃ ♛ ᴘʟᴀʏ
│┃ ♛ ᴘʟᴀʏ2
│┃ ♛ ᴘʟᴀʏᴠɪᴅ
│┃ ♛ ʏᴛᴍᴘ4
│┃ ♛ ᴛɪᴋᴛᴏᴋ
│┃ ♛ ғᴀᴄᴇʙᴏᴏᴋ
│┃ ♛ ɪɴsᴛᴀɢʀᴀᴍ
│┃ ♛ ɪɴsᴛᴀɢʀᴀᴍ2
╰───────────────────≽
╭──⧼♛ Aɴᴛɪ X Aᴜᴛᴏ ᴄᴏᴍᴍᴀɴᴅs ♛⧽──≽
│┃ ♛ ᴀɴᴛɪᴄᴀʟʟ
│┃ ♛ ᴀɴᴛɪᴇᴅɪᴛ
│┃ ♛ ᴀɴᴛɪᴅᴇʟᴇᴛᴇ
│┃ ♛ ᴀᴜᴛᴏʀᴇᴄᴏʀᴅɪɴɢ
│┃ ♛ ᴀᴜᴛᴏʀᴇᴀᴅ
│┃ ♛ ᴀᴜᴛᴏʀᴇᴀᴄᴛ
│┃ ♛ ᴀᴜᴛᴏᴛʏᴘɪɴɢ 
╰────────────────────≽

 ╭──⧼♛ ᴇᴘʜᴏᴛᴏ ᴄᴏᴍᴍᴀɴᴅs ♛⧽──≽
│┃ ♛ sᴀɴᴅ
│┃ ♛ sᴜᴍᴍᴇʀʙᴇᴀᴄʜ
│┃ ♛ ᴛᴏᴘᴏɢʀᴀᴘʜʏ
│┃ ♛ ᴛʏᴘᴏɢʀᴀᴘʜʏ
│┃ ♛ ʟᴜxᴜʀʏɢᴏʟᴅ
│┃ ♛ ɢᴀʟᴀxʏsᴛʏʟᴇ
│┃ ♛ ɢᴀʟᴀxʏᴡᴀʟʟᴘᴀᴘᴇʀ
│┃ ♛ ᴍᴀᴋɪɴɢɴᴇᴏɴ
│┃ ♛ ᴍᴀᴛʀɪx
│┃ ♛ ʀᴏʏᴀʟᴛᴇxᴛ
│┃ ♛ ᴄᴀʀᴛᴏᴏɴsᴛʏʟᴇ
│┃ ♛ ᴅᴇᴀᴅᴘᴏᴏʟ
│┃ ♛ ᴇғғᴇᴄᴛᴄʟᴏᴜɴᴅs
│┃ ♛ ғʟᴀɢᴛᴇxᴛ
│┃ ♛ ғʀᴇᴇᴄʀᴇᴀᴛᴇ
│┃ ♛ ʙʟᴀᴄᴋᴘɪɴᴋsᴛʏʟᴇ
│┃ ♛ ʙʟᴀᴄᴋᴘɪɴᴋʟᴏɢᴏ
│┃ ♛ ᴀᴅᴠᴀɴᴄᴇᴅɢʟᴏᴡ
╰────────────────────≽

╭──⧼♛ Gʀᴏᴜᴘ ᴄᴏᴍᴍᴀɴᴅs ♛⧽──≽
│┃ ♛ sᴡɢᴄ
│┃ ♛ ᴋɪᴄᴋ
│┃ ♛ ᴘʀᴏᴍᴏᴛᴇ
│┃ ♛ ᴅᴇᴍᴏᴛᴇ
│┃ ♛ ᴛᴀɢᴀʟʟ
│┃ ♛ ʜɪᴅᴇᴛᴀɢ
│┃ ♛ ʟɪɴᴋɢᴄ
│┃ ♛ ʀᴇsᴇᴛʟɪɴᴋɢᴄ
│┃ ♛ ᴏᴘᴇɴɢᴄ
│┃ ♛ ᴄʟᴏsᴇɢᴄ
│┃ ♛ sᴡɢᴄ_ᴘʀᴏᴄᴇss
│┃ ♛ ᴊᴏɪɴɢᴄ
│┃ ♛ ʟᴇᴀᴠᴇ
│┃ ♛ ʟɪɴᴋ
│┃ ♛ sᴇᴛᴅᴇsᴄ
│┃ ♛ ᴊɪᴅ
│┃ ♛ ᴏᴘᴇɴ
│┃ ♛ ᴏᴘᴇɴᴛɪᴍᴇ
│┃ ♛ ᴄʟᴏsᴇ
│┃ ♛ ᴄʟᴏsᴇᴛɪᴍᴇ
│┃ ♛ sᴇᴛɢᴄᴘᴘ
│┃ ♛ ᴀɴᴛɪʟɪɴᴋ
│┃ ♛ ᴀɴᴛɪᴛᴀɢᴀᴅᴍɪɴ
│┃ ♛ ɪɴᴠɪᴛᴇ
╰───────────────────≽

╭──⧼♛ Oᴛʜᴇʀ ᴄᴏᴍᴍᴀɴᴅs ♛⧽──≽
│┃ ♛ ᴘᴀɪʀ
│┃ ♛ ʀɪᴅᴢᴄᴏᴅᴇʀ
│┃ ♛ ғᴀᴍɪʟʏ
│┃ ♛ sᴜᴘᴘᴏʀᴛ
╰───────────────────≽
`

  await clutch.sendMessage(
    m.chat,
    {
      image: { url: global.image.menu },
      caption: teksnya,
      contextInfo: {
        mentionedJid: [m.sender],
        forwardingScore: 999,
        isForwarded: true,
        forwardedNewsletterMessageInfo: {
          newsletterJid: "120363404529319592@newsletter",
          newsletterName: "Airbyte Synergetic Labs🪀",
          serverMessageId: 3
        }
      }
    }
  )
}

handler.command = ["menu","ridz","kevin"]

module.exports = handler